{"title":"Mission Improbabl","description":"Do you have what it takes to design an infallible security system? Maybe you consider yourself   a hacker without equal, able to break into any system undetected. If so then our upcoming   hackathon will give you the chance to demonstrate your skills! Rendez-vous @ Imperial College London on the 20th of February!","subscibe-form":"https:\/\/docs.google.com\/forms\/d\/1AaSuHS6cxABsr2-2ddErvAo9MLbsWSBRAczjEpldGNM","details":"####Address: Imperial College London, EEE building, 5th floor, room 506\n#### Dates: 20-28 February\n#### Contact: Miles\n#--\n\n###ICAH & ICRS present ...Mission Improbable.\n\nThis week long hackathon will have teams design and create a device to detect attempts to interfere with or steal a 3D printed Yoda bust. Participants will have the chance to demonstrate all their electronics skills. At the end of the week each team will have the opportunity to attempt to hack another team’s device and steal the Yoda bust, without being detected!\n\n###Timeline 20th to 28th February\n\nOn Friday 20th of January we will hold an introductory meeting where we aim to form teams, get ideas flowing and most importantly eat some pizza! You will be shown how to order components through ICRS, including a trick to get a special discount from RS (and FREE shipping). \n\nWe will also take orders on your behalf for those that rather not hassle with the receipts, though being aware of how the system works will make you a professional ICRS project builder!\n\nParts that are ordered over the weekend will arrive on Monday\/Tuesday. This will give you most of the week to work on your contraption. There will be a supervised hack on Wednesday 25th February, where we will be on hand to help with any issues.\n\nThe finals will be held on Saturday 28th February. Until 2pm you will have some time to make last minute hacks to your devices. \n\nYou will be allocated another team’s device to attempt to steal from. You will have the opportunity to hear a very short presentation on how the contraption works from the designers, and you will be able to ask questions regarding their contraption. Full disclosure of all mechanisms is mandatory.\n\nHackers will then give a short description of the plan to the judges and implement their hack live, with a time limit of 3 minutes. The judges will then decide who were the best designers and the best hackers. At around 5pm there will be prize-giving, followed by a wind down in Eastside bar.","background-image":"http:\/\/cdn2.denofgeek.us\/sites\/denofgeekus\/files\/mission_impossible_4-wide.jpg","organisation-logo":"public\/icah_logo_red.png","event-logo":"public\/event-logo.png","video-key":"https:\/\/www.youtube.com\/watch?v=0BMPaEKd0Xo","main-color":" #ed1c24"}